{
  "backend/main.mo": "Minimal Motoko canister entry point defining an empty actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report documenting implemented frontend features, associated files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summary map describing the purpose of key frontend source files and configuration files.",
  "frontend/index.css": "Global Tailwind CSS setup defining base styles, design tokens, and light/dark industrial-themed color variables.",
  "frontend/index.html": "HTML entry point setting up the root container and global SEO metadata for the Built Rite Creations site.",
  "frontend/src/App.tsx": "Main React application configuring TanStack Router routes for all pages and rendering them within the SiteLayout.",
  "frontend/src/components/SiteFooter.tsx": "Footer component displaying contact details, service links, navigation shortcuts, and social media icons.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with branding, desktop and mobile navigation menus, and a call-to-action button.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper providing a consistent page structure with header, routed content outlet, and footer.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages a backend actor instance based on authentication state using React Query.",
  "frontend/src/hooks/useDocumentTitle.ts": "React hook that sets and restores the document title with a Built Rite Creations suffix for SEO.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity authentication, including login, logout, persisted identity loading, and detailed login status state using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently exports nothing for this static marketing site.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining base styles, light and dark color themes, typography rules, and utility classes for the application.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers and importing global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with a hero section, mission statement, and values grid using reusable UI components and icons.",
  "frontend/src/pages/ContactPage.tsx": "Implements a Contact page with a hero section, contact form state handling, and company contact information using styled UI components.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery page with a hero section, grid of sample project cards, and a call-to-action linking to the contact page.",
  "frontend/src/pages/HomePage.tsx": "Defines the home page layout including hero, mission, and feature sections that highlight services and link to key routes.",
  "frontend/src/pages/ServicesPage.tsx": "Defines the Services page with a hero section and a grid of cards describing laser cleaning services, using shared UI components and setting the document title to \"Services\".",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors via CSS variables, typography, container queries, animations, fonts, shadows, and dark mode for the frontend theme.",
  "project_state.json": "Tracks overall project metadata and requirements, describing the goal to recreate and rebrand precisionlasernw.com as \"Built Rite Creations\" with a responsive, themed frontend site."
}