{
  "backend/main.mo": "Defines an empty Internet Computer actor with no methods or state, serving as a placeholder backend.",
  "feature_evidence.json": "Feature evidence report documenting the successful replacement of an incorrect phone number with a new one via centralized business constants, with high confidence.",
  "frontend-file-summaries.txt": "JSON document providing brief descriptions of all major frontend source files, components, pages, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens, color variables, and base styles for the application.",
  "frontend/index.html": "HTML entry point for the frontend with SEO metadata, page title, Google Fonts, and root mount element for the React app.",
  "frontend/src/App.tsx": "Main React application file configuring TanStack Router with hash-based routing and defining all top-level routes wrapped in the site layout.",
  "frontend/src/components/SiteFooter.tsx": "Footer component displaying contact details, service links, navigation links, and social icons using centralized businessInfo constants.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with branding, navigation links, active route highlighting, and a mobile slide-out menu with a call-to-action button.",
  "frontend/src/components/SiteLayout.tsx": "Layout component that composes the site header, footer, and routed page content using TanStack Router’s Outlet.",
  "frontend/src/content/businessInfo.ts": "Centralized configuration file defining business name, phone number, email, hours, service area, and social media links.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an Internet Computer backend actor based on authentication state, using React Query for caching and invalidation.",
  "frontend/src/hooks/useDocumentTitle.ts": "Custom hook that updates the browser document title for each page and restores the previous title on unmount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY AuthClient, managing login state, identity persistence, and logout behavior.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently exports nothing for the static site.",
  "frontend/src/index.css": "Defines Tailwind CSS setup with custom light/dark theme variables, base typography styles, and utility classes for the application.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query and Internet Identity providers, and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Implements the About page with mission, values, and company overview sections using cards, icons, and Tailwind styling.",
  "frontend/src/pages/contactMailto.ts": "Provides a utility function that builds a prefilled mailto: URL from contact form data so quote requests can be sent via the user’s email client on static hosting.",
  "frontend/src/pages/ContactPage.tsx": "Implements the Contact page with a validated contact form, submission success state, and business contact details.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery of sample laser cleaning projects in a responsive grid with a call-to-action to contact the company.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero, mission, and feature sections highlighting laser cleaning services and navigation CTAs.",
  "frontend/src/pages/ServicesPage.tsx": "Defines the Services page React component, setting the document title and rendering a hero section plus a responsive grid of static laser-cleaning service cards with CTAs using shadcn/ui and TanStack Router links.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom container settings, fonts, shadows, animations, and a token-based OKLCH color system, plus typography, container-queries, and animation plugins.",
  "frontend/TRADITIONAL_HOSTING_GUIDE.md": "Step-by-step guide for building and deploying the static frontend to traditional hosting providers, including troubleshooting and hash-based routing notes.",
  "frontend/vite.config.ts": "Vite configuration for a React app with path aliasing, static-friendly base path, customized build output, and a development server on port 3000.",
  "project_state.json": "High-level metadata describing the project’s purpose, architecture, and existing features for a static Vite + React + Tailwind marketing SPA with hash-based routing and a mailto-based contact form."
}